balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF45K22.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2ADD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP2ADD" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPADD" edc:desc="" edc:mask="0xff" edc:name="SSPADD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP2BUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SSP2BUF" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPBUF" edc:desc="" edc:mask="0xff" edc:name="SSPBUF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="crnnn-nn" edc:cname="BAUDCON2" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01x00-00" edc:name="BAUDCON2" edc:nzwidth="0x8" edc:por="01x00-00">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="BAUD2CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKTXP" edc:desc="" edc:mask="0x1" edc:name="CKTXP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DTRXP" edc:desc="" edc:mask="0x1" edc:name="DTRXP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SCKP" edc:desc="" edc:mask="0x1" edc:name="SCKP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RCSTA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RCSTA2" edc:nzwidth="0x8" edc:por="0000000x">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RC2STA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="" edc:mask="0x1" edc:name="ADEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RX9D2" edc:desc="" edc:mask="0x1" edc:name="RX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR2" edc:desc="" edc:mask="0x1" edc:name="OERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR2" edc:desc="" edc:mask="0x1" edc:name="FERR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN2" edc:desc="" edc:mask="0x1" edc:name="ADDEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN2" edc:desc="" edc:mask="0x1" edc:name="CREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN2" edc:desc="" edc:mask="0x1" edc:name="SREN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX92" edc:desc="" edc:mask="0x1" edc:name="RX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN2" edc:desc="" edc:mask="0x1" edc:name="SPEN2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnrn" edc:cname="TXSTA2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000010" edc:name="TXSTA2" edc:nzwidth="0x8" edc:por="00000010">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TX2STA"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TX9D2" edc:desc="" edc:mask="0x1" edc:name="TX9D2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT2" edc:desc="" edc:mask="0x1" edc:name="TRMT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH2" edc:desc="" edc:mask="0x1" edc:name="BRGH2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB2" edc:desc="" edc:mask="0x1" edc:name="SENDB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC2" edc:desc="" edc:mask="0x1" edc:name="SYNC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN2" edc:desc="" edc:mask="0x1" edc:name="TXEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX92" edc:desc="" edc:mask="0x1" edc:name="TX92" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC2" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="TXREG2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="TXREG2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TX2REG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX2REG" edc:desc="" edc:mask="0xff" edc:name="TX2REG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RCREG2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RCREG2" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RC2REG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC2REG" edc:desc="" edc:mask="0xff" edc:name="RC2REG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
        </edc:SFRDef>
