balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF45K22.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="PIE4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PIE4" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3IE" edc:desc="" edc:mask="0x1" edc:name="CCP3IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4IE" edc:desc="" edc:mask="0x1" edc:name="CCP4IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5IE" edc:desc="" edc:mask="0x1" edc:name="CCP5IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PIR4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PIR4" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3IF" edc:desc="" edc:mask="0x1" edc:name="CCP3IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4IF" edc:desc="" edc:mask="0x1" edc:name="CCP4IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5IF" edc:desc="" edc:mask="0x1" edc:name="CCP5IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="IPR4" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="IPR4" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3IP" edc:desc="" edc:mask="0x1" edc:name="CCP3IP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4IP" edc:desc="" edc:mask="0x1" edc:name="CCP4IP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5IP" edc:desc="" edc:mask="0x1" edc:name="CCP5IP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PIE5" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="PIE5" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4IE" edc:desc="" edc:mask="0x1" edc:name="TMR4IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5IE" edc:desc="" edc:mask="0x1" edc:name="TMR5IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6IE" edc:desc="" edc:mask="0x1" edc:name="TMR6IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="PIR5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="PIR5" edc:nzwidth="0x8" edc:por="-----111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4IF" edc:desc="" edc:mask="0x1" edc:name="TMR4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IF" edc:desc="" edc:mask="0x1" edc:name="TMR5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IF" edc:desc="" edc:mask="0x1" edc:name="TMR6IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="IPR5" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="IPR5" edc:nzwidth="0x8" edc:por="-----111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4IP" edc:desc="" edc:mask="0x1" edc:name="TMR4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR5IP" edc:desc="" edc:mask="0x1" edc:name="TMR5IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR6IP" edc:desc="" edc:mask="0x1" edc:name="TMR6IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu0u0000" edc:name="PORTA" edc:nzwidth="0x8" edc:por="xx0x0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5" edc:desc="" edc:mask="0x1" edc:name="RA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA6" edc:desc="" edc:mask="0x1" edc:name="RA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:mask="0xff" edc:name="RA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN0" edc:desc="" edc:mask="0x1" edc:name="AN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN1" edc:desc="" edc:mask="0x1" edc:name="AN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN2" edc:desc="" edc:mask="0x1" edc:name="AN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AN3" edc:desc="" edc:mask="0x1" edc:name="AN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="AN4" edc:desc="" edc:mask="0x1" edc:name="AN4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="C12IN0M" edc:desc="" edc:mask="0x1" edc:name="C12IN0M" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C12IN1M" edc:desc="" edc:mask="0x1" edc:name="C12IN1M" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INP" edc:desc="" edc:mask="0x1" edc:name="C2INP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1INP" edc:desc="" edc:mask="0x1" edc:name="C1INP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="C12IN0N" edc:desc="" edc:mask="0x1" edc:name="C12IN0N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C12IN1N" edc:desc="" edc:mask="0x1" edc:name="C12IN1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VREFM" edc:desc="" edc:mask="0x1" edc:name="VREFM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VREFP" edc:desc="" edc:mask="0x1" edc:name="VREFP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CKI" edc:desc="" edc:mask="0x1" edc:name="T0CKI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SS" edc:desc="" edc:mask="0x1" edc:name="SS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="VREFN" edc:desc="" edc:mask="0x1" edc:name="VREFN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SRQ" edc:desc="" edc:mask="0x1" edc:name="SRQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nSS" edc:desc="" edc:mask="0x1" edc:name="nSS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CVREF" edc:desc="" edc:mask="0x1" edc:name="CVREF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LVDIN" edc:desc="" edc:mask="0x1" edc:name="LVDIN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACOUT" edc:desc="" edc:mask="0x1" edc:name="DACOUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="HLVDIN" edc:desc="" edc:mask="0x1" edc:name="HLVDIN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.6">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="SS1" edc:desc="" edc:mask="0x1" edc:name="SS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.7">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="nSS1" edc:desc="" edc:mask="0x1" edc:name="nSS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.8">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="SRNQ" edc:desc="" edc:mask="0x1" edc:name="SRNQ" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu00000" edc:name="PORTB" edc:nzwidth="0x8" edc:por="xxx00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:mask="0xff" edc:name="RB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT0" edc:desc="" edc:mask="0x1" edc:name="INT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1" edc:desc="" edc:mask="0x1" edc:name="INT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2" edc:desc="" edc:mask="0x1" edc:name="INT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2" edc:desc="" edc:mask="0x1" edc:name="CCP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="KBI0" edc:desc="" edc:mask="0x1" edc:name="KBI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="KBI1" edc:desc="" edc:mask="0x1" edc:name="KBI1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="KBI2" edc:desc="" edc:mask="0x1" edc:name="KBI2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="KBI3" edc:desc="" edc:mask="0x1" edc:name="KBI3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="AN12" edc:desc="" edc:mask="0x1" edc:name="AN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN10" edc:desc="" edc:mask="0x1" edc:name="AN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN8" edc:desc="" edc:mask="0x1" edc:name="AN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN9" edc:desc="" edc:mask="0x1" edc:name="AN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN11" edc:desc="" edc:mask="0x1" edc:name="AN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN13" edc:desc="" edc:mask="0x1" edc:name="AN13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PGC" edc:desc="" edc:mask="0x1" edc:name="PGC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PGD" edc:desc="" edc:mask="0x1" edc:name="PGD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="FLT0" edc:desc="" edc:mask="0x1" edc:name="FLT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C12IN3M" edc:desc="" edc:mask="0x1" edc:name="C12IN3M" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C12IN2M" edc:desc="" edc:mask="0x1" edc:name="C12IN2M" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5G" edc:desc="" edc:mask="0x1" edc:name="T5G" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1G" edc:desc="" edc:mask="0x1" edc:name="T1G" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="SRI" edc:desc="" edc:mask="0x1" edc:name="SRI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C12IN3N" edc:desc="" edc:mask="0x1" edc:name="C12IN3N" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C12IN2N" edc:desc="" edc:mask="0x1" edc:name="C12IN2N" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP3" edc:desc="" edc:mask="0x1" edc:name="CCP3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CTED1" edc:desc="" edc:mask="0x1" edc:name="CTED1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTED2" edc:desc="" edc:mask="0x1" edc:name="CTED2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T3CKI" edc:desc="" edc:mask="0x1" edc:name="T3CKI" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="P2A" edc:desc="" edc:mask="0x1" edc:name="P2A" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="P3A" edc:desc="" edc:mask="0x1" edc:name="P3A" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
